tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Static analysis of C and C++ code
brew "cppcheck"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic library support script
brew "libtool"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Wrap web apps natively
brew "nativefier"
# Fast, highly customisable system info script
brew "neofetch"
# Development kit for the Java programming language
brew "openjdk"
# Count lines of code in many languages
brew "sloccount"
# SMART hard drive monitoring
brew "smartmontools"
# Simplified and community-driven man pages
brew "tldr"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Sound and music editor
cask "ableton-live-lite10"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Search engine for developers
cask "devbook"
# Voice and text chat software
cask "discord"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal built on web technologies
cask "hyper"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Control your smart light system
cask "philips-hue-sync"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Identify Intel-only apps
cask "silicon"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdBlock Pro", id: 1018301773
mas "Affinity Photo", id: 824183456
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Remote Mouse", id: 403195710
mas "Spark", id: 1176895641
mas "Youtube Ads Auto-Skipper", id: 1542270454
